.
├── coverage
│   ├── lcov-report
│   │   └── src
│   │       ├── app
│   │       │   ├── _components
│   │       │   │   ├── BlockList
│   │       │   │   │   ├── LayoutA
│   │       │   │   │   │   └── __tests__
│   │       │   │   │   │       └── __snapshots__
│   │       │   │   │   └── __tests__
│   │       │   │   │       └── __snapshots__
│   │       │   │   ├── NavBar
│   │       │   │   │   └── __tests__
│   │       │   │   │       └── __snapshots__
│   │       │   │   ├── Stats
│   │       │   │   │   ├── CurrentStackingCycle
│   │       │   │   │   ├── LastBlock
│   │       │   │   │   ├── NextStackingCycle
│   │       │   │   │   └── StxSupply
│   │       │   │   └── StatusBar
│   │       │   │       └── __tests__
│   │       │   │           └── __snapshots__
│   │       │   ├── address
│   │       │   │   └── [principal]
│   │       │   │       ├── StxBalance
│   │       │   │       └── TokenBalanceCard
│   │       │   ├── block
│   │       │   │   └── [hash]
│   │       │   │       └── tx-lists
│   │       │   ├── blocks
│   │       │   ├── microblock
│   │       │   │   └── [hash]
│   │       │   │       └── tx-lists
│   │       │   ├── sandbox
│   │       │   │   ├── components
│   │       │   │   │   ├── Argument
│   │       │   │   │   └── ContractCall
│   │       │   │   │       └── DefaultView
│   │       │   │   ├── contract-call
│   │       │   │   │   └── [[...params]]
│   │       │   │   ├── deploy
│   │       │   │   ├── editor-config
│   │       │   │   ├── faucet
│   │       │   │   ├── hooks
│   │       │   │   ├── layout
│   │       │   │   └── transfer
│   │       │   ├── token
│   │       │   │   └── [tokenId]
│   │       │   │       ├── Tabs
│   │       │   │       └── TokenInfo
│   │       │   ├── tokens
│   │       │   │   ├── TokenRow
│   │       │   │   └── TokensList
│   │       │   ├── transactions
│   │       │   └── txid
│   │       │       └── [txId]
│   │       │           ├── Cards
│   │       │           ├── CoinbasePage
│   │       │           ├── ContractCall
│   │       │           ├── PoisonMicroblock
│   │       │           ├── SmartContract
│   │       │           ├── TenureChange
│   │       │           ├── TokenTransfer
│   │       │           └── TxDetails
│   │       │               └── __tests__
│   │       │                   └── __snapshots__
│   │       ├── common
│   │       │   ├── api
│   │       │   ├── components
│   │       │   │   ├── __tests__
│   │       │   │   ├── balances
│   │       │   │   ├── icons
│   │       │   │   ├── loaders
│   │       │   │   ├── meta
│   │       │   │   └── modals
│   │       │   │       └── AddNetwork
│   │       │   │           └── __tests__
│   │       │   ├── constants
│   │       │   │   └── contracts
│   │       │   ├── context
│   │       │   │   └── __tests__
│   │       │   ├── hooks
│   │       │   ├── mockData
│   │       │   ├── queries
│   │       │   │   └── __tests__
│   │       │   ├── state
│   │       │   │   └── slices
│   │       │   ├── styles
│   │       │   ├── types
│   │       │   └── utils
│   │       │       ├── __tests__
│   │       │       └── test-utils
│   │       ├── features
│   │       │   ├── search
│   │       │   │   ├── dropdown
│   │       │   │   ├── items
│   │       │   │   └── search-field
│   │       │   ├── txs-list
│   │       │   │   ├── ListItem
│   │       │   │   └── tabs
│   │       │   │       └── __tests__
│   │       │   │           └── __snapshots__
│   │       │   └── txsFilterAndSort
│   │       └── ui
│   │           ├── CodeEditor
│   │           ├── icons
│   │           └── theme
│   │               ├── fonts
│   │               └── recipes
├── docs
│   └── how-to-guides
├── e2e
├── public
│   └── static
├── src
│   ├── __tests__
│   │   └── pages
│   │       └── token
│   │           └── [tokenId]
│   ├── app
│   │   ├── _components
│   │   │   ├── BlockList
│   │   │   │   ├── BlocksPage
│   │   │   │   ├── Grouped
│   │   │   │   ├── HomePage
│   │   │   │   ├── LayoutA
│   │   │   │   │   └── __tests__
│   │   │   │   │       └── __snapshots__
│   │   │   │   └── Sockets
│   │   │   ├── NavBar
│   │   │   │   └── __tests__
│   │   │   │       └── __snapshots__
│   │   │   ├── Stats
│   │   │   │   ├── CurrentStackingCycle
│   │   │   │   ├── LastBlock
│   │   │   │   ├── NextStackingCycle
│   │   │   │   └── StxSupply
│   │   │   └── StatusBar
│   │   │       └── __tests__
│   │   ├── address
│   │   │   └── [principal]
│   │   │       ├── StxBalance
│   │   │       └── TokenBalanceCard
│   │   ├── block
│   │   │   └── [hash]
│   │   │       └── tx-lists
│   │   ├── blocks
│   │   ├── btcblock
│   │   │   └── [hash]
│   │   ├── microblock
│   │   │   └── [hash]
│   │   │       └── tx-lists
│   │   ├── sandbox
│   │   │   ├── components
│   │   │   │   ├── Argument
│   │   │   │   └── ContractCall
│   │   │   │       ├── DefaultView
│   │   │   │       └── __tests__
│   │   │   ├── contract-call
│   │   │   │   └── [[...params]]
│   │   │   ├── deploy
│   │   │   ├── editor-config
│   │   │   ├── faucet
│   │   │   ├── hooks
│   │   │   ├── layout
│   │   │   ├── transfer
│   │   │   └── types
│   │   ├── search
│   │   │   └── filters
│   │   ├── signer
│   │   │   └── [signerKey]
│   │   ├── signers
│   │   │   ├── __tests__
│   │   │   └── data
│   │   ├── support
│   │   ├── token
│   │   │   └── [tokenId]
│   │   │       ├── Tabs
│   │   │       │   └── data
│   │   │       │       └── holders
│   │   │       ├── TokenInfo
│   │   │       └── __tests__
│   │   ├── tokens
│   │   │   ├── TokenRow
│   │   │   ├── TokensList
│   │   │   └── __tests__
│   │   │       └── __snapshots__
│   │   ├── transactions
│   │   └── txid
│   │       └── [txId]
│   │           ├── Cards
│   │           ├── CoinbasePage
│   │           ├── ContractCall
│   │           ├── PoisonMicroblock
│   │           ├── SmartContract
│   │           ├── TenureChange
│   │           ├── TokenTransfer
│   │           └── TxDetails
│   │               └── __tests__
│   ├── common
│   │   ├── api
│   │   ├── components
│   │   │   ├── __tests__
│   │   │   ├── balances
│   │   │   ├── icons
│   │   │   ├── loaders
│   │   │   ├── meta
│   │   │   └── modals
│   │   │       └── AddNetwork
│   │   │           └── __tests__
│   │   ├── constants
│   │   │   └── contracts
│   │   ├── context
│   │   │   └── __tests__
│   │   ├── hooks
│   │   ├── mockData
│   │   ├── queries
│   │   │   └── __tests__
│   │   ├── state
│   │   │   └── slices
│   │   ├── styles
│   │   ├── types
│   │   └── utils
│   │       ├── __tests__
│   │       └── test-utils
│   ├── components
│   │   └── ui
│   ├── features
│   │   ├── search
│   │   │   ├── dropdown
│   │   │   ├── items
│   │   │   └── search-field
│   │   ├── txs-list
│   │   │   ├── ListItem
│   │   │   └── tabs
│   │   │       └── __tests__
│   │   │           └── __snapshots__
│   │   └── txsFilterAndSort
│   ├── stories
│   │   └── Typography
│   └── ui
│       ├── CodeEditor
│       ├── icons
│       └── theme
│           ├── fonts
│           └── recipes
